Hi folks 👋 I tried this out on recent versions of Terraform CLI and the Terraform AWS Provider, and was either able to have Terraform produce a more valid error or work as expected with configuration fixes.

Example configuration:

```hcl
terraform {
  required_providers {
    aws = "2.40.0"
  }
  required_version = "0.12.16"
}

provider "aws" {
  region = "us-east-2"
}

data "aws_vpc" "test" {
  default = true
}

data "aws_subnet_ids" "test" {
  vpc_id = data.aws_vpc.test.id
}

data "aws_subnet" "test" {
  count = length(data.aws_subnet_ids.test.ids)
  id = data.aws_subnet_ids.test.ids[count.index]
}

resource "aws_security_group" "test" {
  vpc_id = data.aws_vpc.test.id
}

resource "aws_route53_resolver_endpoint" "test" {
  direction          = "OUTBOUND"
  security_group_ids = [aws_security_group.test.id]

  dynamic "ip_address" {
    for_each = data.aws_subnet.test[*].id

    content {
      subnet_id = ip_address.value
    }
  }
}

```

Plan:

```
terraform apply
data.aws_vpc.test: Refreshing state...
data.aws_subnet_ids.test: Refreshing state...

Error: Invalid index

  on main.tf line 22, in data "aws_subnet" "test":
  22:   id = data.aws_subnet_ids.test.ids[count.index]
    |----------------
    | count.index is 0
    | data.aws_subnet_ids.test.ids is set of string with 3 elements

This value does not have any indices.


Error: Invalid index

  on main.tf line 22, in data "aws_subnet" "test":
  22:   id = data.aws_subnet_ids.test.ids[count.index]
    |----------------
    | count.index is 1
    | data.aws_subnet_ids.test.ids is set of string with 3 elements

This value does not have any indices.


Error: Invalid index

  on main.tf line 22, in data "aws_subnet" "test":
  22:   id = data.aws_subnet_ids.test.ids[count.index]
    |----------------
    | count.index is 2
    | data.aws_subnet_ids.test.ids is set of string with 3 elements

This value does not have any indices.
```

These errors are correct in this situation since in Terraform 0.12 sets cannot be indexed (as compared to lists, which can be indexed). Changing the `for_each` line to use the `aws_subnet_ids` data source directly:

```hcl
terraform {
  required_providers {
    aws = "2.40.0"
  }
  required_version = "0.12.16"
}

provider "aws" {
  region = "us-east-2"
}

data "aws_vpc" "test" {
  default = true
}

data "aws_subnet_ids" "test" {
  vpc_id = data.aws_vpc.test.id
}

resource "aws_security_group" "test" {
  vpc_id = data.aws_vpc.test.id
}

resource "aws_route53_resolver_endpoint" "test" {
  direction          = "OUTBOUND"
  security_group_ids = [aws_security_group.test.id]

  dynamic "ip_address" {
    for_each = data.aws_subnet_ids.test.ids

    content {
      subnet_id = ip_address.value
    }
  }
}
```

Plans as expected:

```
...
  # aws_route53_resolver_endpoint.test will be created
  + resource "aws_route53_resolver_endpoint" "test" {
      + arn                = (known after apply)
      + direction          = "OUTBOUND"
      + host_vpc_id        = (known after apply)
      + id                 = (known after apply)
      + security_group_ids = (known after apply)

      + ip_address {
          + ip        = (known after apply)
          + ip_id     = (known after apply)
          + subnet_id = "subnet-2c271266"
        }
      + ip_address {
          + ip        = (known after apply)
          + ip_id     = (known after apply)
          + subnet_id = "subnet-2d8d9855"
        }
      + ip_address {
          + ip        = (known after apply)
          + ip_id     = (known after apply)
          + subnet_id = "subnet-7635c81f"
        }
    }
...
```

Its likely some combination of Terraform CLI and/or Terraform AWS Provider upgrade fixed this along the way. If you are still having trouble on recent versions, please open a new [bug report](https://github.com/terraform-providers/terraform-provider-aws/issues/new?template=Bug_Report.md) with a fully replicating configuration and we'll take a further look. Thanks.